public class Seatwork03 {
	public static void main(String[] args) {
		// 目标
		// 需要实现循环遍历一个范围内的每一个整数
		// 例如：1 - 5 之间

		// 实现步骤
		// 1.循环1~5范围内的每一个整数
		// 开始循环次数为1
		// 结束循环次数为5

		// 初始化变量
		int sum = 0;
		for (int i = 1; i <= 5; i++) {
			// 展示小技巧：
			// 1.如果变量在循环外部声明，那么在循环内部可以多次使用，因为变量的作用域是整个方法
			// 2.如果变量在循环内部声明，那么在循环结束后变量将失效，因此在循环内部声明的变量只能在循环内部使用
			// 循环变量的使用需要注意变量的作用域和生命周期
			// 第二种循环开始时只会初始化一次变量
			// 因此，如果需要在循环外部使用变量，必须在循环外部声明
			// 初始化变量时，需要注意变量的作用域和生命周期
			// int sum = 0;
			// 初始化变量后，循环变量会将每次循环的值累加到 sum 中
			sum += i; // sum = sum + i;
		}

		// 循环结束后，打印1~5累加后的结果 sum 的值
		System.out.println(sum);
	}
}